sprawozdanie/AdamSalwowski_sprawozdanie.tex
% Created 2022-03-21 Mon 18:50
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{tabularx}
\usepackage{minted}
\author{Adam Salwowski}
\date{\today}
\title{Statyczna? strona portfolio wraz z poradnikami programistycznymi dla początkujących}
\hypersetup{
 pdfauthor={Adam Salwowski},
 pdftitle={Statyczna? strona portfolio wraz z poradnikami programistycznymi dla początkujących},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={Polish}}
\begin{document}

\maketitle
\tableofcontents

\begin{itemize}
\item KUPIC PRZEJŚCIÓWKI DO LAPTOPA
\begin{itemize}
\item ethernet to usb
\item usb to usb-c
\item usb-c to usb-port??
\end{itemize}
\end{itemize}

\section{Strona portfolio wraz z poradnikami programistycznymi dla początkujących}
\label{sec:org7bfa714}
\subsection{Spis treści w języku polskim}
\label{sec:orgf11e60e}
\subsection{Streszczenie w języku polskim}
\label{sec:org20c9f4a}
\subsection{Spis treści w języku angielskim}
\label{sec:orgdf31590}
\subsection{Streszczenie w języku angielskim}
\label{sec:org5ad5dc8}
\subsection{Wstęp}
\label{sec:orgece8758}
Strona portfolio prezentująca projekty programisty. Centrum informacji dla początkujących programistów w postaci poradników i treściwych objaśnień.
\subsubsection{Cel projektu}
\label{sec:org4deb373}
\begin{enumerate}
\item Dla pracodawcy
\label{sec:org3bf2ac0}
\begin{itemize}
\item pokazanie z jakimi typami programista miał do czynienia
\item pokazanie sposobu rozwiązywania problemów
\item pokazanie jak wygląda kod (czy jest schludny i czytelny, lub może chaotyczny)
\item pokazanie czy dobrze zna technologie
\item pokazanie czy zna najnowsze rozwiązania w programowaniu
\end{itemize}
\item Dla programisty
\label{sec:org13e76d4}
\begin{itemize}
\item pozwala uporządkować doświadczenie i przedstawić je lepiej niż w CV
\item pokazuje realne doświadczenie i wiedzę
\item pokazuje czego programista jeszcze nie robił i w jakim kierunku mógłby się jeszcze rozwinąć
\end{itemize}
\item Dla początkującego
\label{sec:org089f731}
\begin{itemize}
\item miejsce w którym może się zapoznać w dość szybkim czasie z wieloma technologiami
\end{itemize}
\end{enumerate}
\subsubsection{Dla kogo ta aplikacja jest przeznaczona}
\label{sec:org8bdfb58}
\begin{itemize}
\item firmy zatrudniające programisów
\item początkujący programiści
\end{itemize}
\subsubsection{Użyte technologie użyte podczas produkcji strony}
\label{sec:org82dbcb5}
\begin{itemize}
\item apache / nginx
\item html
\item css
\item org-mode
\item VPS (Virtual Private Server)
\item deployment strony
\item obraz png (zdjęcie)
\end{itemize}
\subsubsection{Użyte technologie podczas produkcji dokumentacji}
\label{sec:org1039836}
\begin{itemize}
\item latex
\item org-mode
\end{itemize}
\subsubsection{Użyte technologie w celu dydaktycznym}
\label{sec:orgbf721d2}
\begin{itemize}
\item instalacja niezbędnych pakietów
\item komendy unixowe:
\begin{itemize}
\item wget?
\item curl?
\item imagemagick?
\item ffmpeg?
\end{itemize}
\item konfiguracja edytora tekstowego Emacs
\begin{itemize}
\item instalacja pakietów
\item przykładowe funkcje oraz ich działanie
\item obsługa magit?
\end{itemize}
\item python
\begin{itemize}
\item moduły:
\begin{enumerate}
\item argparse
\item pathlib
\item os
\item beautifulsoup4
\item requests
\end{enumerate}
\end{itemize}
\item html
\item css
\item java
\item c
\item c++
\item emacs lisp
\item latex
\item markdown
\item org-mode
\item regex
\item git
\end{itemize}
\subsection{Specyfikacja wymagań}
\label{sec:org38298f8}
\subsubsection{słownik pojęć}
\label{sec:org4e65413}
\subsubsection{specyfikacja grup użytkowników}
\label{sec:org8fb2c40}
\subsubsection{pojęcia systemowe}
\label{sec:orgef861b9}
\subsubsection{wymagania funkcjonalne}
\label{sec:org3937903}
dlaczego z jakiej strony, administator
\subsection{Użyte technologie}
\label{sec:org5d5410c}
\subsubsection{opis używanych języków i technologii oprogramowania (html,css)}
\label{sec:orgeb21466}
\subsection{{\bfseries\sffamily TODO} Projekt aplikacji (zrobić na następne zajęcia!!!) (czy to w ogóle jest możliwe dla statycznej strony?, jeśli nie to poszukać dlaczego nie i napisac!!!!!)}
\label{sec:org482ed28}
\subsubsection{{\bfseries\sffamily TODO} UML}
\label{sec:orgb4bf8c5}
\subsubsection{{\bfseries\sffamily TODO} Przypadki użycia}
\label{sec:org1c44285}
\begin{itemize}
\item przypadek1
\item przypadek2
\item przypadek3
\end{itemize}
\subsubsection{{\bfseries\sffamily TODO} Aktorzy}
\label{sec:org27d89c3}
\begin{itemize}
\item pracodawca
\item programista (ja)
\item początkujący
\end{itemize}
\subsubsection{{\bfseries\sffamily TODO} Diagram przypadków użycia}
\label{sec:org10ba167}
\subsubsection{{\bfseries\sffamily TODO} Diagram encji}
\label{sec:org15062fa}
\subsubsection{{\bfseries\sffamily TODO} Diagram klas}
\label{sec:org85e93b3}
\subsection{Interfejs użytkownika}
\label{sec:orgf2c3bdf}
\subsubsection{Graficzna instrukcja użytkowania aplikacji}
\label{sec:orgff500fe}
\subsection{Podsumowanie efektu pracy}
\label{sec:org1cbad59}
\subsubsection{Jak można jeszcze rozwinąc aplikację w przyszłości}
\label{sec:orgf07b9e7}
\subsubsection{Co się udało zrobić, a czego nie}
\label{sec:orgc5da7f2}
\subsection{Bibliografia}
\label{sec:org27afaaf}
\subsubsection{Wykorzystane źródła}
\label{sec:org3ce5cd6}
\begin{enumerate}
\item Strony internetowe
\label{sec:orgca59240}
\begin{enumerate}
\item Strony portfolio
\label{sec:org2e02209}
\begin{itemize}
\item \url{https://lukesmith.xyz}
\end{itemize}
\item Strony dydaktyczne
\label{sec:org1238f6b}
\begin{itemize}
\item \url{https://landchad.net}
\item \url{https://xahlee.info}
\end{itemize}
\end{enumerate}
\item Książki
\label{sec:org9376193}
\item Prezentacje?
\label{sec:orgbb5254d}
\end{enumerate}
\subsubsection{nie tylko strony internetowy, mają być książki, prezentacje}
\label{sec:orgc08315a}
\subsection{Podsumowanie}
\label{sec:orgcc9e2fb}
\end{document}